/**
 * 
 * @author wangjue / https://github.com/hanmag
 */

var NETWORK = NETWORK || {};

(function () {

    var china = {
        "Cities": [{
            name: '建业',
            lonlat: {
                x: 118.786218,
                y: 32.084562
            }
        }, {
            name: '柴桑',
            lonlat: {
                x: 115.984599,
                y: 29.70665
            }
        }, {
            name: '吴',
            lonlat: {
                x: 120.632157,
                y: 31.302344
            }
        }, {
            name: '小沛',
            lonlat: {
                x: 116.941098,
                y: 34.752545
            }
        }, {
            name: '会稽',
            lonlat: {
                x: 120.58926,
                y: 30.037145
            }
        }, {
            name: '长安',
            lonlat: {
                x: 108.954355,
                y: 34.282795
            }
        }, {
            name: '洛阳',
            lonlat: {
                x: 112.452272,
                y: 34.645048
            }
        }, {
            name: '许昌',
            lonlat: {
                x: 113.82704,
                y: 34.027976
            }
        }, {
            name: '汉中',
            lonlat: {
                x: 107.029766,
                y: 33.074667
            }
        }, {
            name: '襄阳',
            lonlat: {
                x: 112.127652,
                y: 32.013074
            }
        }, {
            name: '下邳',
            lonlat: {
                x: 117.881254,
                y: 34.129241
            }
        }, {
            name: '新野',
            lonlat: {
                x: 112.365604,
                y: 32.525909
            }
        }, {
            name: '宛',
            lonlat: {
                x: 112.545337,
                y: 33.009643
            }
        }, {
            name: '陈留',
            lonlat: {
                x: 114.309161,
                y: 34.807802
            }
        }, {
            name: '寿春',
            lonlat: {
                x: 116.80392,
                y: 32.562944
            }
        }, {
            name: '武陵',
            lonlat: {
                x: 111.693949,
                y: 29.060627
            }
        }, {
            name: '零陵',
            lonlat: {
                x: 111.639634,
                y: 26.228141
            }
        }, {
            name: '桂阳',
            lonlat: {
                x: 112.74042,
                y: 25.75981
            }
        }, {
            name: '永安',
            lonlat: {
                x: 108.04298,
                y: 30.869345
            }
        }, {
            name: '上庸',
            lonlat: {
                x: 110.175772,
                y: 32.173633
            }
        }, {
            name: '江州',
            lonlat: {
                x: 106.57161,
                y: 29.560316
            }
        }, {
            name: '梓潼',
            lonlat: {
                x: 104.681454,
                y: 31.472012
            }
        }, {
            name: '建宁',
            lonlat: {
                x: 103.804122,
                y: 25.513677
            }
        }, {
            name: '云南',
            lonlat: {
                x: 102.863325,
                y: 25.026418
            }
        }, {
            name: '庐江',
            lonlat: {
                x: 117.292202,
                y: 31.257012
            }
        }, {
            name: '汝南',
            lonlat: {
                x: 114.36956,
                y: 33.012588
            }
        }, {
            name: '江夏',
            lonlat: {
                x: 114.327929,
                y: 30.381209
            }
        }, {
            name: '长沙',
            lonlat: {
                x: 112.980978,
                y: 28.20367
            }
        }, {
            name: '成都',
            lonlat: {
                x: 104.070929,
                y: 30.66454
            }
        }, {
            name: '天水',
            lonlat: {
                x: 105.419025,
                y: 34.72488
            }
        }, {
            name: '安定',
            lonlat: {
                x: 107.369671,
                y: 35.357426
            }
        }, {
            name: '威武',
            lonlat: {
                x: 102.61444,
                y: 37.939954
            }
        }, {
            name: '南皮',
            lonlat: {
                x: 116.714918,
                y: 38.046547
            }
        }, {
            name: '平原',
            lonlat: {
                x: 116.433843,
                y: 37.167851
            }
        }, {
            name: '邺',
            lonlat: {
                x: 114.259608,
                y: 36.225794
            }
        }, {
            name: '晋阳',
            lonlat: {
                x: 112.550878,
                y: 37.85203
            }
        }, {
            name: '蓟',
            lonlat: {
                x: 116.400906,
                y: 39.915662
            }
        }, {
            name: '北平',
            lonlat: {
                x: 119.408848,
                y: 41.25259
            }
        }, {
            name: '襄平',
            lonlat: {
                x: 123.194691,
                y: 41.275816
            }
        }, {
            name: '濮阳',
            lonlat: {
                x: 115.028443,
                y: 35.7711
            }
        }, {
            name: '江陵',
            lonlat: {
                x: 112.434028,
                y: 30.055332
            }
        }, {
            name: '北海',
            lonlat: {
                x: 119.204629,
                y: 36.753067
            }
        }],
        "Paths": [
            ['威武', '安定'],
            ['威武', '天水'],
            ['安定', '天水'],
            ['汉中', '天水'],
            ['汉中', '上庸'],
            ['汉中', '梓潼'],
            ['成都', '梓潼'],
            ['成都', '江州'],
            ['成都', '建宁'],
            ['云南', '建宁'],
            ['江州', '建宁'],
            ['江州', '梓潼'],
            ['江州', '永安'],
            ['江陵', '永安'],
            ['江陵', '襄阳'],
            ['江陵', '武陵'],
            ['零陵', '武陵'],
            ['零陵', '桂阳'],
            ['长沙', '桂阳'],
            ['长沙', '柴桑'],
            ['庐江', '柴桑'],
            ['庐江', '建业'],
            ['吴', '建业'],
            ['吴', '会稽'],
            ['庐江', '寿春'],
            ['汝南', '寿春'],
            ['汝南', '新野'],
            ['汝南', '许昌'],
            ['寿春', '小沛'],
            ['寿春', '下邳'],
            ['小沛', '下邳'],
            ['新野', '襄阳'],
            ['新野', '宛'],
            ['上庸', '宛'],
            ['许昌', '宛'],
            ['洛阳', '宛'],
            ['洛阳', '长安'],
            ['洛阳', '陈留'],
            ['洛阳', '许昌'],
            ['陈留', '小沛'],
            ['陈留', '濮阳'],
            ['下邳', '北海'],
            ['长安', '安定'],
            ['长安', '汉中'],
            ['江夏', '江陵'],
            ['江夏', '柴桑'],
            ['濮阳', '邺'],
            ['平原', '邺'],
            ['晋阳', '邺'],
            ['晋阳', '蓟'],
            ['南皮', '蓟'],
            ['南皮', '平原'],
            ['南皮', '北平'],
            ['蓟', '北平'],
            ['襄平', '北平'],
        ]
    };

    NETWORK.China = china;
})();